Тест/Тест/src/Reports/АналитикаЦенДеталей/АналитикаЦенДеталей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>АналитикаЦенДеталей</name>
</mdclass:Report>

Тест/Тест/src/InformationRegisters/ИсторияИзмененияЦен/ИсторияИзмененияЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияИзмененияЦен</name>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйПользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИндНомер</name>
    <type>
      <types>CatalogRef.ИндКод</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест/Тест/src/AccumulationRegisters/РегистрНакопления1/РегистрНакопления1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РегистрНакопления1</name>
  <resources>
    <name>Колво</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>индкод</name>
    <type>
      <types>CatalogRef.ИндКод</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест/Тест/src/Reports/АналитикаЦенДеталей/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура ПериодДатаИзмененияЦеныПриИзменении(Элемент)
	ПериодДатаИзмененияЦеныПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПериодДатаИзмененияЦеныПриИзмененииНаСервере()
	
	///+ТатарМА 19.11.2024
	Если ПериодДатаИзмененияЦены.ДатаНачала = '00010101' И ПериодДатаИзмененияЦены.ДатаОкончания = '00010101' Тогда
		АналитикаЦен.ТекстЗапроса = "ВЫБРАТЬ
		|	ИсторияИзмененияЦен.ИндНомер КАК ИндНомер,
		|	МАКСИМУМ(ИсторияИзмененияЦен.Дата) КАК Дата
		|ПОМЕСТИТЬ ВТ_ДатаЦеныДетали
		|ИЗ
		|	РегистрСведений.ИсторияИзмененияЦен КАК ИсторияИзмененияЦен
		|ГДЕ
		|	НЕ ИсторияИзмененияЦен.Цена = 0
		|СГРУППИРОВАТЬ ПО
		|	ИсторияИзмененияЦен.ИндНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДатаЦеныДетали.ИндНомер КАК ИндНомер,
		|	ВТ_ДатаЦеныДетали.Дата КАК Дата,
		|	ИсторияИзмененияЦен.Цена КАК Цена,
		|	ИсторияИзмененияЦен.ОтветственныйПользователь КАК ОтветственныйПользователь
		|ПОМЕСТИТЬ ВТ_ЦеныДеталейСДатой
		|ИЗ
		|	ВТ_ДатаЦеныДетали КАК ВТ_ДатаЦеныДетали
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияИзмененияЦен КАК ИсторияИзмененияЦен
		|		ПО ВТ_ДатаЦеныДетали.ИндНомер = ИсторияИзмененияЦен.ИндНомер
		|		И ВТ_ДатаЦеныДетали.Дата = ИсторияИзмененияЦен.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЦеныДеталейСДатой.ИндНомер КАК ИндНомер,
		|	СУММА(1) КАК СпросНаТовар
		|ПОМЕСТИТЬ ВТ_СпросЗапчастейНаТовар
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЦеныДеталейСДатой КАК ВТ_ЦеныДеталейСДатой
		|		ПО ЗаказКлиентаТовары.Номенклатура = ВТ_ЦеныДеталейСДатой.ИндНомер.Владелец
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЦеныДеталейСДатой.ИндНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЦеныДеталейСДатой.ИндНомер КАК ИндНомер,
		|	СУММА(1) КАК СпросНаДеталь
		|ПОМЕСТИТЬ ВТ_СпросЗапчастей
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЦеныДеталейСДатой КАК ВТ_ЦеныДеталейСДатой
		|		ПО ЗаказКлиентаТовары.Партия = ВТ_ЦеныДеталейСДатой.ИндНомер
		|		И ЗаказКлиентаТовары.Ссылка.Дата >= ВТ_ЦеныДеталейСДатой.Дата
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЦеныДеталейСДатой.ИндНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЦеныДеталейСДатой.ИндНомер КАК ИндНомер,
		|	СУММА(ВЫБОР
		|		КОГДА ПродажаЗапчастейТаблица.СтатусТовара = ИСТИНА
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК ПродажаТовара
		|ПОМЕСТИТЬ ВТ_ПродажаТовара
		|ИЗ
		|	ВТ_ЦеныДеталейСДатой КАК ВТ_ЦеныДеталейСДатой
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПродажаЗапчастей.Таблица КАК ПродажаЗапчастейТаблица
		|		ПО (ПродажаЗапчастейТаблица.Товар = ВТ_ЦеныДеталейСДатой.ИндНомер.Владелец)
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЦеныДеталейСДатой.ИндНомер,
		|	ВТ_ЦеныДеталейСДатой.Цена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЦеныДеталейСДатой.Дата КАК ДатаИзмененияЦены,
		|	ВТ_ЦеныДеталейСДатой.ИндНомер КАК ИндНомер,
		|	ВТ_ЦеныДеталейСДатой.ИндНомер.Владелец КАК Номенклатура,
		|	ВТ_ЦеныДеталейСДатой.ИндНомер.Владелец.Артикул КАК Артикул,
		|	ВТ_ЦеныДеталейСДатой.ИндНомер.Владелец.НомерПроизводителя КАК НомерПроизводителя,
		|	ВТ_СпросЗапчастейНаТовар.СпросНаТовар КАК СпросНаТовар,
		|	ВТ_СпросЗапчастей.СпросНаДеталь КАК СпросНаДеталь,
		|	ВТ_ЦеныДеталейСДатой.Цена КАК Цена,
		|	ВЫБОР
		|		КОГДА ВЫБОР
		|			КОГДА ПродажаЗапчастейТаблица.СтатусТовара = ИСТИНА
		|				ТОГДА ПродажаЗапчастейТаблица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ > 0
		|			ТОГДА ""Продан""
		|		ИНАЧЕ ""В наличии""
		|	КОНЕЦ КАК Статус,
		|	ВЫБОР
		|		КОГДА ПродажаЗапчастейТаблица.СтатусТовара = ИСТИНА
		|			ТОГДА ПродажаЗапчастейТаблица.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаПродажи,
		|	ПродажаЗапчастейТаблица.Ссылка.Дата КАК ДатаПродажи,
		|	ПродажаЗапчастейТаблица.Ссылка.Ссылка КАК Продажа,
		|	ВТ_ЦеныДеталейСДатой.ОтветственныйПользователь КАК ОтветственныйПользователь,
		|	ВЫБОР
		|		КОГДА ПродажаЗапчастейТаблица.СтатусТовара = ИСТИНА
		|			ТОГДА ПродажаЗапчастейТаблица.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ * 0.01 КАК Начисления,
		|	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
		|	ВТ_ПродажаТовара.ПродажаТовара КАК ПродажаТовара
		|ИЗ
		|	ВТ_ЦеныДеталейСДатой КАК ВТ_ЦеныДеталейСДатой
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СпросЗапчастей КАК ВТ_СпросЗапчастей
		|		ПО (ВТ_ЦеныДеталейСДатой.ИндНомер = ВТ_СпросЗапчастей.ИндНомер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СпросЗапчастейНаТовар КАК ВТ_СпросЗапчастейНаТовар
		|		ПО (ВТ_ЦеныДеталейСДатой.ИндНомер = ВТ_СпросЗапчастейНаТовар.ИндНомер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПродажаЗапчастей.Таблица КАК ПродажаЗапчастейТаблица
		|		ПО (ВТ_ЦеныДеталейСДатой.ИндНомер = ПродажаЗапчастейТаблица.Партия)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
		|		ПО (ВТ_ЦеныДеталейСДатой.ИндНомер = РегистрНакопления1Остатки.индкод)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПродажаТовара КАК ВТ_ПродажаТовара
		|		ПО (ВТ_ЦеныДеталейСДатой.ИндНомер = ВТ_ПродажаТовара.ИндНомер)";
	
	Иначе
		ПериодДатаПродажи.ДатаНачала 	= '00010101';
		ПериодДатаПродажи.ДатаОкончания = '00010101';
		
		АналитикаЦен.ТекстЗапроса = "ВЫБРАТЬ
		|	ИсторияИзмененияЦен.ИндНомер КАК ИндНомер,
		|	МАКСИМУМ(ИсторияИзмененияЦен.Дата) КАК Дата
		|ПОМЕСТИТЬ ВТ_ДатаЦеныДетали
		|ИЗ
		|	РегистрСведений.ИсторияИзмененияЦен КАК ИсторияИзмененияЦен
		|ГДЕ
		|	НЕ ИсторияИзмененияЦен.Цена = 0
		|СГРУППИРОВАТЬ ПО
		|	ИсторияИзмененияЦен.ИндНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДатаЦеныДетали.ИндНомер КАК ИндНомер,
		|	ВТ_ДатаЦеныДетали.Дата КАК Дата,
		|	ИсторияИзмененияЦен.Цена КАК Цена,
		|	ИсторияИзмененияЦен.ОтветственныйПользователь КАК ОтветственныйПользователь
		|ПОМЕСТИТЬ ВТ_ЦеныДеталейСДатой
		|ИЗ
		|	ВТ_ДатаЦеныДетали КАК ВТ_ДатаЦеныДетали
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияИзмененияЦен КАК ИсторияИзмененияЦен
		|		ПО (ВТ_ДатаЦеныДетали.ИндНомер = ИсторияИзмененияЦен.ИндНомер)
		|		И (ВТ_ДатаЦеныДетали.Дата = ИсторияИзмененияЦен.Дата)
		|ГДЕ
		|	ВТ_ДатаЦеныДетали.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЦеныДеталейСДатой.ИндНомер КАК ИндНомер,
		|	СУММА(1) КАК СпросНаТовар
		|ПОМЕСТИТЬ ВТ_СпросЗапчастейНаТовар
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЦеныДеталейСДатой КАК ВТ_ЦеныДеталейСДатой
		|		ПО ЗаказКлиентаТовары.Номенклатура = ВТ_ЦеныДеталейСДатой.ИндНомер.Владелец
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЦеныДеталейСДатой.ИндНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЦеныДеталейСДатой.ИндНомер КАК ИндНомер,
		|	СУММА(1) КАК СпросНаДеталь
		|ПОМЕСТИТЬ ВТ_СпросЗапчастей
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЦеныДеталейСДатой КАК ВТ_ЦеныДеталейСДатой
		|		ПО ЗаказКлиентаТовары.Партия = ВТ_ЦеныДеталейСДатой.ИндНомер
		|		И ЗаказКлиентаТовары.Ссылка.Дата >= ВТ_ЦеныДеталейСДатой.Дата
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЦеныДеталейСДатой.ИндНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЦеныДеталейСДатой.ИндНомер КАК ИндНомер,
		|	СУММА(ВЫБОР
		|		КОГДА ПродажаЗапчастейТаблица.СтатусТовара = ИСТИНА
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК ПродажаТовара
		|ПОМЕСТИТЬ ВТ_ПродажаТовара
		|ИЗ
		|	ВТ_ЦеныДеталейСДатой КАК ВТ_ЦеныДеталейСДатой
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПродажаЗапчастей.Таблица КАК ПродажаЗапчастейТаблица
		|		ПО (ПродажаЗапчастейТаблица.Товар = ВТ_ЦеныДеталейСДатой.ИндНомер.Владелец)
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЦеныДеталейСДатой.ИндНомер,
		|	ВТ_ЦеныДеталейСДатой.Цена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЦеныДеталейСДатой.Дата КАК ДатаИзмененияЦены,
		|	ВТ_ЦеныДеталейСДатой.ИндНомер КАК ИндНомер,
		|	ВТ_ЦеныДеталейСДатой.ИндНомер.Владелец КАК Номенклатура,
		|	ВТ_ЦеныДеталейСДатой.ИндНомер.Владелец.Артикул КАК Артикул,
		|	ВТ_ЦеныДеталейСДатой.ИндНомер.Владелец.НомерПроизводителя КАК НомерПроизводителя,
		|	ВТ_СпросЗапчастейНаТовар.СпросНаТовар КАК СпросНаТовар,
		|	ВТ_СпросЗапчастей.СпросНаДеталь КАК СпросНаДеталь,
		|	ВТ_ЦеныДеталейСДатой.Цена КАК Цена,
		|	ВЫБОР
		|		КОГДА ВЫБОР
		|			КОГДА ПродажаЗапчастейТаблица.СтатусТовара = ИСТИНА
		|				ТОГДА ПродажаЗапчастейТаблица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ > 0
		|			ТОГДА ""Продан""
		|		ИНАЧЕ ""В наличии""
		|	КОНЕЦ КАК Статус,
		|	ВЫБОР
		|		КОГДА ПродажаЗапчастейТаблица.СтатусТовара = ИСТИНА
		|			ТОГДА ПродажаЗапчастейТаблица.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаПродажи,
		|	ПродажаЗапчастейТаблица.Ссылка.Дата КАК ДатаПродажи,
		|	ПродажаЗапчастейТаблица.Ссылка.Ссылка КАК Продажа,
		|	ВТ_ЦеныДеталейСДатой.ОтветственныйПользователь КАК ОтветственныйПользователь,
		|	ВЫБОР
		|		КОГДА ПродажаЗапчастейТаблица.СтатусТовара = ИСТИНА
		|			ТОГДА ПродажаЗапчастейТаблица.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ * 0.01 КАК Начисления,
		|	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
		|	ВТ_ПродажаТовара.ПродажаТовара КАК ПродажаТовара
		|ИЗ
		|	ВТ_ЦеныДеталейСДатой КАК ВТ_ЦеныДеталейСДатой
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СпросЗапчастей КАК ВТ_СпросЗапчастей
		|		ПО ВТ_ЦеныДеталейСДатой.ИндНомер = ВТ_СпросЗапчастей.ИндНомер
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СпросЗапчастейНаТовар КАК ВТ_СпросЗапчастейНаТовар
		|		ПО ВТ_ЦеныДеталейСДатой.ИндНомер = ВТ_СпросЗапчастейНаТовар.ИндНомер
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПродажаЗапчастей.Таблица КАК ПродажаЗапчастейТаблица
		|		ПО ВТ_ЦеныДеталейСДатой.ИндНомер = ПродажаЗапчастейТаблица.Партия
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
		|		ПО ВТ_ЦеныДеталейСДатой.ИндНомер = РегистрНакопления1Остатки.индкод
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПродажаТовара КАК ВТ_ПродажаТовара
		|		ПО ВТ_ЦеныДеталейСДатой.ИндНомер = ВТ_ПродажаТовара.ИндНомер";
		
		АналитикаЦен.Параметры.УстановитьЗначениеПараметра("ДатаНачала", 	ПериодДатаИзмененияЦены.ДатаНачала);
		АналитикаЦен.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ПериодДатаИзмененияЦены.ДатаОкончания);
	КонецЕсли;
	///-ТатарМА 19.11.2024

КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаПродажиПриИзменении(Элемент)
	ПериодДатаПродажиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПериодДатаПродажиПриИзмененииНаСервере()
	
	///+ТатарМА 19.11.2024
	Если ПериодДатаПродажи.ДатаНачала = '00010101' И ПериодДатаПродажи.ДатаОкончания = '00010101' Тогда
		АналитикаЦен.ТекстЗапроса = "ВЫБРАТЬ
		|	ИсторияИзмененияЦен.ИндНомер КАК ИндНомер,
		|	МАКСИМУМ(ИсторияИзмененияЦен.Дата) КАК Дата
		|ПОМЕСТИТЬ ВТ_ДатаЦеныДетали
		|ИЗ
		|	РегистрСведений.ИсторияИзмененияЦен КАК ИсторияИзмененияЦен
		|ГДЕ
		|	НЕ ИсторияИзмененияЦен.Цена = 0
		|СГРУППИРОВАТЬ ПО
		|	ИсторияИзмененияЦен.ИндНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДатаЦеныДетали.ИндНомер КАК ИндНомер,
		|	ВТ_ДатаЦеныДетали.Дата КАК Дата,
		|	ИсторияИзмененияЦен.Цена КАК Цена,
		|	ИсторияИзмененияЦен.ОтветственныйПользователь КАК ОтветственныйПользователь
		|ПОМЕСТИТЬ ВТ_ЦеныДеталейСДатой
		|ИЗ
		|	ВТ_ДатаЦеныДетали КАК ВТ_ДатаЦеныДетали
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияИзмененияЦен КАК ИсторияИзмененияЦен
		|		ПО ВТ_ДатаЦеныДетали.ИндНомер = ИсторияИзмененияЦен.ИндНомер
		|		И ВТ_ДатаЦеныДетали.Дата = ИсторияИзмененияЦен.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЦеныДеталейСДатой.ИндНомер КАК ИндНомер,
		|	СУММА(1) КАК СпросНаТовар
		|ПОМЕСТИТЬ ВТ_СпросЗапчастейНаТовар
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЦеныДеталейСДатой КАК ВТ_ЦеныДеталейСДатой
		|		ПО ЗаказКлиентаТовары.Номенклатура = ВТ_ЦеныДеталейСДатой.ИндНомер.Владелец
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЦеныДеталейСДатой.ИндНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЦеныДеталейСДатой.ИндНомер КАК ИндНомер,
		|	СУММА(1) КАК СпросНаДеталь
		|ПОМЕСТИТЬ ВТ_СпросЗапчастей
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЦеныДеталейСДатой КАК ВТ_ЦеныДеталейСДатой
		|		ПО ЗаказКлиентаТовары.Партия = ВТ_ЦеныДеталейСДатой.ИндНомер
		|		И ЗаказКлиентаТовары.Ссылка.Дата >= ВТ_ЦеныДеталейСДатой.Дата
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЦеныДеталейСДатой.ИндНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЦеныДеталейСДатой.ИндНомер КАК ИндНомер,
		|	СУММА(ВЫБОР
		|		КОГДА ПродажаЗапчастейТаблица.СтатусТовара = ИСТИНА
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК ПродажаТовара
		|ПОМЕСТИТЬ ВТ_ПродажаТовара
		|ИЗ
		|	ВТ_ЦеныДеталейСДатой КАК ВТ_ЦеныДеталейСДатой
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПродажаЗапчастей.Таблица КАК ПродажаЗапчастейТаблица
		|		ПО (ПродажаЗапчастейТаблица.Товар = ВТ_ЦеныДеталейСДатой.ИндНомер.Владелец)
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЦеныДеталейСДатой.ИндНомер,
		|	ВТ_ЦеныДеталейСДатой.Цена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЦеныДеталейСДатой.Дата КАК ДатаИзмененияЦены,
		|	ВТ_ЦеныДеталейСДатой.ИндНомер КАК ИндНомер,
		|	ВТ_ЦеныДеталейСДатой.ИндНомер.Владелец КАК Номенклатура,
		|	ВТ_ЦеныДеталейСДатой.ИндНомер.Владелец.Артикул КАК Артикул,
		|	ВТ_ЦеныДеталейСДатой.ИндНомер.Владелец.НомерПроизводителя КАК НомерПроизводителя,
		|	ВТ_СпросЗапчастейНаТовар.СпросНаТовар КАК СпросНаТовар,
		|	ВТ_СпросЗапчастей.СпросНаДеталь КАК СпросНаДеталь,
		|	ВТ_ЦеныДеталейСДатой.Цена КАК Цена,
		|	ВЫБОР
		|		КОГДА ВЫБОР
		|			КОГДА ПродажаЗапчастейТаблица.СтатусТовара = ИСТИНА
		|				ТОГДА ПродажаЗапчастейТаблица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ > 0
		|			ТОГДА ""Продан""
		|		ИНАЧЕ ""В наличии""
		|	КОНЕЦ КАК Статус,
		|	ВЫБОР
		|		КОГДА ПродажаЗапчастейТаблица.СтатусТовара = ИСТИНА
		|			ТОГДА ПродажаЗапчастейТаблица.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаПродажи,
		|	ПродажаЗапчастейТаблица.Ссылка.Дата КАК ДатаПродажи,
		|	ПродажаЗапчастейТаблица.Ссылка.Ссылка КАК Продажа,
		|	ВТ_ЦеныДеталейСДатой.ОтветственныйПользователь КАК ОтветственныйПользователь,
		|	ВЫБОР
		|		КОГДА ПродажаЗапчастейТаблица.СтатусТовара = ИСТИНА
		|			ТОГДА ПродажаЗапчастейТаблица.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ * 0.01 КАК Начисления,
		|	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
		|	ВТ_ПродажаТовара.ПродажаТовара КАК ПродажаТовара
		|ИЗ
		|	ВТ_ЦеныДеталейСДатой КАК ВТ_ЦеныДеталейСДатой
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СпросЗапчастей КАК ВТ_СпросЗапчастей
		|		ПО (ВТ_ЦеныДеталейСДатой.ИндНомер = ВТ_СпросЗапчастей.ИндНомер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СпросЗапчастейНаТовар КАК ВТ_СпросЗапчастейНаТовар
		|		ПО (ВТ_ЦеныДеталейСДатой.ИндНомер = ВТ_СпросЗапчастейНаТовар.ИндНомер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПродажаЗапчастей.Таблица КАК ПродажаЗапчастейТаблица
		|		ПО (ВТ_ЦеныДеталейСДатой.ИндНомер = ПродажаЗапчастейТаблица.Партия)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
		|		ПО (ВТ_ЦеныДеталейСДатой.ИндНомер = РегистрНакопления1Остатки.индкод)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПродажаТовара КАК ВТ_ПродажаТовара
		|		ПО (ВТ_ЦеныДеталейСДатой.ИндНомер = ВТ_ПродажаТовара.ИндНомер)";
	
	Иначе
		ПериодДатаИзмененияЦены.ДатаНачала 		= '00010101';
		ПериодДатаИзмененияЦены.ДатаОкончания 	= '00010101';
		
		АналитикаЦен.ТекстЗапроса = "ВЫБРАТЬ
		|	ИсторияИзмененияЦен.ИндНомер КАК ИндНомер,
		|	МАКСИМУМ(ИсторияИзмененияЦен.Дата) КАК Дата
		|ПОМЕСТИТЬ ВТ_ДатаЦеныДетали
		|ИЗ
		|	РегистрСведений.ИсторияИзмененияЦен КАК ИсторияИзмененияЦен
		|ГДЕ
		|	НЕ ИсторияИзмененияЦен.Цена = 0
		|СГРУППИРОВАТЬ ПО
		|	ИсторияИзмененияЦен.ИндНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДатаЦеныДетали.ИндНомер КАК ИндНомер,
		|	ВТ_ДатаЦеныДетали.Дата КАК Дата,
		|	ИсторияИзмененияЦен.Цена КАК Цена,
		|	ИсторияИзмененияЦен.ОтветственныйПользователь КАК ОтветственныйПользователь
		|ПОМЕСТИТЬ ВТ_ЦеныДеталейСДатой
		|ИЗ
		|	ВТ_ДатаЦеныДетали КАК ВТ_ДатаЦеныДетали
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияИзмененияЦен КАК ИсторияИзмененияЦен
		|		ПО ВТ_ДатаЦеныДетали.ИндНомер = ИсторияИзмененияЦен.ИндНомер
		|		И ВТ_ДатаЦеныДетали.Дата = ИсторияИзмененияЦен.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЦеныДеталейСДатой.ИндНомер КАК ИндНомер,
		|	СУММА(1) КАК СпросНаТовар
		|ПОМЕСТИТЬ ВТ_СпросЗапчастейНаТовар
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЦеныДеталейСДатой КАК ВТ_ЦеныДеталейСДатой
		|		ПО ЗаказКлиентаТовары.Номенклатура = ВТ_ЦеныДеталейСДатой.ИндНомер.Владелец
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЦеныДеталейСДатой.ИндНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЦеныДеталейСДатой.ИндНомер КАК ИндНомер,
		|	СУММА(1) КАК СпросНаДеталь
		|ПОМЕСТИТЬ ВТ_СпросЗапчастей
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЦеныДеталейСДатой КАК ВТ_ЦеныДеталейСДатой
		|		ПО ЗаказКлиентаТовары.Партия = ВТ_ЦеныДеталейСДатой.ИндНомер
		|		И ЗаказКлиентаТовары.Ссылка.Дата >= ВТ_ЦеныДеталейСДатой.Дата
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЦеныДеталейСДатой.ИндНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЦеныДеталейСДатой.ИндНомер КАК ИндНомер,
		|	СУММА(ВЫБОР
		|		КОГДА ПродажаЗапчастейТаблица.СтатусТовара = ИСТИНА
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК ПродажаТовара
		|ПОМЕСТИТЬ ВТ_ПродажаТовара
		|ИЗ
		|	ВТ_ЦеныДеталейСДатой КАК ВТ_ЦеныДеталейСДатой
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПродажаЗапчастей.Таблица КАК ПродажаЗапчастейТаблица
		|		ПО (ПродажаЗапчастейТаблица.Товар = ВТ_ЦеныДеталейСДатой.ИндНомер.Владелец)
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЦеныДеталейСДатой.ИндНомер,
		|	ВТ_ЦеныДеталейСДатой.Цена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЦеныДеталейСДатой.Дата КАК ДатаИзмененияЦены,
		|	ВТ_ЦеныДеталейСДатой.ИндНомер КАК ИндНомер,
		|	ВТ_ЦеныДеталейСДатой.ИндНомер.Владелец КАК Номенклатура,
		|	ВТ_ЦеныДеталейСДатой.ИндНомер.Владелец.Артикул КАК Артикул,
		|	ВТ_ЦеныДеталейСДатой.ИндНомер.Владелец.НомерПроизводителя КАК НомерПроизводителя,
		|	ВТ_СпросЗапчастейНаТовар.СпросНаТовар КАК СпросНаТовар,
		|	ВТ_СпросЗапчастей.СпросНаДеталь КАК СпросНаДеталь,
		|	ВТ_ЦеныДеталейСДатой.Цена КАК Цена,
		|	ВЫБОР
		|		КОГДА ВЫБОР
		|			КОГДА ПродажаЗапчастейТаблица.СтатусТовара = ИСТИНА
		|				ТОГДА ПродажаЗапчастейТаблица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ > 0
		|			ТОГДА ""Продан""
		|		ИНАЧЕ ""В наличии""
		|	КОНЕЦ КАК Статус,
		|	ВЫБОР
		|		КОГДА ПродажаЗапчастейТаблица.СтатусТовара = ИСТИНА
		|			ТОГДА ПродажаЗапчастейТаблица.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаПродажи,
		|	ПродажаЗапчастейТаблица.Ссылка.Дата КАК ДатаПродажи,
		|	ПродажаЗапчастейТаблица.Ссылка.Ссылка КАК Продажа,
		|	ВТ_ЦеныДеталейСДатой.ОтветственныйПользователь КАК ОтветственныйПользователь,
		|	ВЫБОР
		|		КОГДА ПродажаЗапчастейТаблица.СтатусТовара = ИСТИНА
		|			ТОГДА ПродажаЗапчастейТаблица.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ * 0.01 КАК Начисления,
		|	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
		|	ВТ_ПродажаТовара.ПродажаТовара КАК ПродажаТовара
		|ИЗ
		|	ВТ_ЦеныДеталейСДатой КАК ВТ_ЦеныДеталейСДатой
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СпросЗапчастей КАК ВТ_СпросЗапчастей
		|		ПО (ВТ_ЦеныДеталейСДатой.ИндНомер = ВТ_СпросЗапчастей.ИндНомер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СпросЗапчастейНаТовар КАК ВТ_СпросЗапчастейНаТовар
		|		ПО (ВТ_ЦеныДеталейСДатой.ИндНомер = ВТ_СпросЗапчастейНаТовар.ИндНомер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПродажаЗапчастей.Таблица КАК ПродажаЗапчастейТаблица
		|		ПО (ВТ_ЦеныДеталейСДатой.ИндНомер = ПродажаЗапчастейТаблица.Партия)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
		|		ПО (ВТ_ЦеныДеталейСДатой.ИндНомер = РегистрНакопления1Остатки.индкод)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПродажаТовара КАК ВТ_ПродажаТовара
		|		ПО (ВТ_ЦеныДеталейСДатой.ИндНомер = ВТ_ПродажаТовара.ИндНомер)
		|ГДЕ
		|	ПродажаЗапчастейТаблица.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
		
		АналитикаЦен.Параметры.УстановитьЗначениеПараметра("ДатаНачала", 	ПериодДатаПродажи.ДатаНачала);
		АналитикаЦен.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ПериодДатаПродажи.ДатаОкончания);
	КонецЕсли;
	///-ТатарМА 19.11.2024
	
КонецПроцедуры


&НаКлиенте
Процедура АналитикаЦенВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	///+ТатарМА 11.10.2024
	ТекСтрока = Элементы.АналитикаЦен.ТекущиеДанные;
	Если Поле = Элементы.АналитикаЦенНоменклатура Тогда
		
		СсылкаДляОткрытия    = ТекСтрока.Номенклатура;
		ПараметрыФормы       = Новый Структура("Ключ", СсылкаДляОткрытия);
		
		ФормаДокумента 		 = ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", ПараметрыФормы);
		ФормаДокумента.Открыть();
	ИначеЕсли Поле = Элементы.АналитикаЦенПродажа Тогда
		
		СсылкаДляОткрытия    = ТекСтрока.Продажа;
		ПараметрыФормы       = Новый Структура("Ключ", СсылкаДляОткрытия);
		
		ФормаДокумента 		 = ПолучитьФорму("Документ.ПродажаЗапчастей.Форма.ФормаДокумента", ПараметрыФормы);
		ФормаДокумента.Открыть();
	КонецЕсли;
	///+ТатарМА 11.10.2024

КонецПроцедуры

&НаКлиенте
Процедура ФотоДетали(Команда)
	
ОбщДействия.ОткрытьДетальНаСайтеWT10(Элементы.АналитикаЦен.ТекущиеДанные.ИндНомер);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьПодвал();
	ПоказатьКоличесвтоЗаписей();
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьКоличесвтоЗаписей()

	Схема = Элементы.АналитикаЦен.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
    Настройки = Элементы.АналитикаЦен.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	ВсегоЗаписей = Результат.Количество(); 
	
	ВПродаже = 0;
	ВНаличии = 0;
	
	Для каждого Строка из Результат Цикл
		Если Строка.Статус = "Продан" Тогда
			ВПродаже = ВПродаже + 1;
		ИначеЕсли Строка.Статус = "В наличии" Тогда
			ВНаличии = ВНаличии + 1;
		КонецЕсли;
	КонецЦикла;
	
	КоличествоВсего = ВсегоЗаписей;
	КоличествоПродано = ВПродаже;
	КоличествоВНаличии = ВНаличии;

КонецПроцедуры




&НаСервере
Процедура ЗаполнитьПодвал()
	
	Схема = Элементы.АналитикаЦен.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.АналитикаЦен.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ЭтотОбъект.ЭтаФорма.Элементы.АналитикаЦенНачисления.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.АналитикаЦенСуммаПродажи.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.АналитикаЦенЦена.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	
	ЭтотОбъект.ЭтаФорма.Элементы.АналитикаЦенНачисления.ТекстПодвала =  Формат(Результат.Итог("Начисления"),"ЧДЦ=2; ЧН=-;");
	ЭтотОбъект.ЭтаФорма.Элементы.АналитикаЦенСуммаПродажи.ТекстПодвала =  Формат(Результат.Итог("СуммаПродажи"),"ЧДЦ=2; ЧН=-;");
	ЭтотОбъект.ЭтаФорма.Элементы.АналитикаЦенЦена.ТекстПодвала =  Формат(Результат.Итог("Цена"),"ЧДЦ=2; ЧН=-;");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодвал(Команда)
	
	ЗаполнитьПодвал();
	ПоказатьКоличесвтоЗаписей();
	
КонецПроцедуры
